# 2022-10-10
# 미사팀 프로젝트
# 주제 : 오프라인 영화 관람객 수 예측
# 목표 : 네이버 뉴스 크롤링
# 기준 : 네이버 뉴스에 올라온 기사 및 댓글 수 (제목과 내용 아이디도 뽑을지는 추가 고민 필요)
# 기간 : 2019.12.31~2022.09.30(우한 폐렴으로 검색한 결과 첫 국내 기사 등록된 날짜 기준)


#########################################################
# 사용자 정의함수 news_all(keyword,start_date,end_date)
#########################################################
getwd()
setwd('C:/Users/user/Documents')

source('뉴스제목사용자정의함수.R') 
news_title_20_01 <- news_all('우한폐렴','2019-12-31','2020-01-31')
news_title_20_01
rownames(news_title_20_01) <- 1:nrow(news_title_20_01)

#우한 폐렴 키워드 완료
news_title_20_02 <- news_all('우한폐렴','2020-02-01','2020-02-29') # 완  
news_title_20_03 <- news_all('우한폐렴','2020-03-01','2020-03-31') # 완 
news_title_20_04 <- news_all('우한폐렴','2020-04-01','2020-04-30') # 완
news_title_20_05 <- news_all('우한폐렴','2020-05-01','2020-05-31') # 완 
news_title_20_06 <- news_all('우한폐렴','2020-06-01','2020-06-30') # 완
news_title_20_07 <- news_all('우한폐렴','2020-07-01','2020-07-31') # 완
news_title_20_08 <- news_all('우한폐렴','2020-08-01','2020-08-31') # 완
news_title_20_09 <- news_all('우한폐렴','2020-09-01','2020-09-30') # 완
news_title_20_10 <- news_all('우한폐렴','2020-10-01','2020-10-31') # 완
news_title_20_11 <- news_all('우한폐렴','2020-11-01','2020-11-30') # 완
news_title_20_12 <- news_all('우한폐렴','2020-12-01','2020-12-31') # 완
news_title_21 <- news_all('우한폐렴','2021-01-01','2021-12-31')    # 완
news_title_22 <- news_all('우한폐렴','2022-01-01','2022-12-31')    # 완

# 코로나 키워드 
news_title_20_01_1 <- news_all('코로나','2019-12-31','2020-01-31') # 완
news_title_20_02_1 <- news_all('코로나','2020-02-01','2020-02-29') # 완
news_title_20_03_1 <- news_all('코로나','2020-03-01','2020-03-31') # 완
news_title_20_04_1 <- news_all('코로나','2020-04-01','2020-04-30') # 완 
news_title_20_05_1 <- news_all('코로나','2020-05-01','2020-05-31') # 완
news_title_20_06_1 <- news_all('코로나','2020-06-01','2020-06-30') 
news_title_20_07_1 <- news_all('코로나','2020-07-01','2020-07-31')
news_title_20_08_1 <- news_all('코로나','2020-08-01','2020-08-31') # 완
news_title_20_09_1 <- news_all('코로나','2020-09-01','2020-09-30') # 완
news_title_20_10_1 <- news_all('코로나','2020-10-01','2020-10-31') # 완
news_title_20_11_1 <- news_all('코로나','2020-11-01','2020-11-30') # 완
news_title_20_12_1 <- news_all('코로나','2020-12-01','2020-12-31') # 완 

# 파일 저장
library(tidyverse)
write_csv(파일명,"파일명.csv")
write_csv(파일명,"파일명.csv")
write_csv(news_title_20_06_1,"corona2006.csv")
write_csv(news_title_20_07_1,"corona2007.csv")